docs/content-org/doc.org
#+STARTUP: content
#+AUTHOR: Iris Garcia
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+OPTIONS: toc:nil

*** Travis CI
:PROPERTIES:
:EXPORT_FILE_NAME: ci/travis
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :asciinema true
:END:
**** Description
Travis is a hosted continuous integration service used to build and
test software projects hosted at GitHub.

It provides a free plan for open source projects which is very
convinient for our use case.

The whole configuration is set up in a single file ~.travis.yml~ which
must be placed in the root directory of the project.
**** Configuration
To avoid replicating exactly the same workflows in GitHub Actions and
Travis, there are some little changes like testing two different Go
versions: ~v1.13.x~ and ~master~ (which is the latest available at any
given time).

It also releases artifacts when a new *tag* is pushed to the
repository.

#+INCLUDE: "../../.travis.yml" src yaml

The following lines tell travis to run the tests against two different
versions of Go (1.13.x and master)

#+begin_src yaml
  go:
  - 1.13.x
  - master
#+end_src

Travis is smart enough to setup all the required dependencies before
it start running the tests, basically it runs:
1. *go get* which fetches all the dependencies defined in the file ~go.mod~
2. *go test* which runs the tests.

The ~tests coverage~ stage is exactly the same as the above but adds
the code coverage percentage which is useful to know if we are missing
some code from beign tested.

#+begin_src yaml
  - stage: tests coverage
    script: go test -cover -v
    go: 1.13.x

#+end_src

And the last stage ~Release artifact to GitHub~ runs only when there
is a tag push, it creates a compressed artifact with the source code
and place it in GitHub's releases.

#+begin_src yaml
  - stage: Release artifact to GitHub
    deploy:
      provider: releases
      api_key: $WORKDAY_RELEASE
      file: "workday"
      skip_cleanup: true
      on:
        tags: true

#+end_src
